docs/ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ideas</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ideas</h1>
<p>
This is an <a href="https://aboutideasnow.com/">ideas</a> page for all of my half-baked and overly ambitious ideas.
</p>

<ul class="org-ul">
<li>Write an epic fantasy series from the ground up (physical laws -&gt; geology -&gt; biology -&gt; sociology -&gt; politics -&gt; story).</li>
<li>Build a robot arm that I can play over the board chess with that is capable of adapting to different play styles.</li>
<li>Build a bass guitar compressor pedal.</li>
<li>Create a program that can calculate magnetic translational forces and torque experience by an object from a CT or X-ray image.</li>
<li>A Python testing library based of [Mathew Prast's blog post - To be a better programmer write little proofs in your head](<a href="https://the-nerve-blog.ghost.io/to-be-a-better-programmer-write-little-proofs-in-your-head/">https://the-nerve-blog.ghost.io/to-be-a-better-programmer-write-little-proofs-in-your-head/</a>) that implements a mathematical proof style test suite written in pure Python with the idea that code can only pass if the following conditions are met:
<ul class="org-ul">
<li><b>Monotonicity</b>: Design systems where processes (e.g., checkpoints, logs) progress unidirectionally to simplify reasoning.</li>
<li><b>Invariants/Preconditions/Postconditions</b>: Explicitly define constraints to ensure correctness and guide testing.</li>
<li><b>Isolation</b>: Use "firewalls" (e.g., component boundaries) to contain changes and prevent unintended side effects.</li>
<li><b>Induction</b>: Prove recursive code correct by verifying base cases and inductive steps.</li>
<li><b>Proof-Affinity</b>: Write code that is inherently easy to reason about, prioritizing clarity and structure over trial-and-error debugging.</li>
</ul></li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-06-17 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
